class Mypage {
  String name;
  String text;
  int pageNumber;
  bool needToStand;

  Mypage(
      {required this.name,
      required this.text,
      required this.pageNumber,
      required this.needToStand});
}

var kadishDerabananText = "Кадиш Дерабанан";
var kadishYatomText =
    "ЙИТГАДАЛ ВЭЙИТКАДАШ ШЭМЭ РАБА. (Амэн!) \n\nБЭАЛМА ДИ-ВЫРА, КИРЪУТЭ, ВЭЯМЛИХ МАЛХУТЭ, ВЭЯЦМАХ ПУРКАНЭ ВИКАРЭВ МЭШИХЭ. (Амэн!) \n\nБЭХАЕХОН УВЪЁМЭХОН, УВЪХАЕ ДЭХОЛЬ БЭТ ЙИСРАЭЛЬ, \nБААГАЛА УВИЗМАН КАРИВ, ВЭИМРУ АМЭН. (Амэн!) \n\nЕЭЭ ШЭМЭ РАБА МЭВАРАХ ЛЫАЛАМ УЛЪАЛЪМЭ АЛЪМАЯ. ЙИТБАРАХ, \n\nВЭЙИШТАБАХ, ВЭЙИТПААР, ВЭЙИТРОМАМ, ВЭЙИТНАСЭ, ВЭЙИТЪАДАР, ВЭЙИТЪАЛЕ ВЭЙИТЪАЛАЛЬ, ШЭМЭ ДЭКУДЪША БЭРИХ У. (Амэн!) \n\nЛЫЭЛА МИН КОЛЬ-БИРХАТА, ШИРАТА, ТИШБЭХАТА ВЭНЭХАМАТА, ДААМИРАН БЭАЛЬМА. ВЭИМРУ АМЭН. (Амэн!) \n\nЕЭЭ ШЭЛАМА РАБА МИН ШЭМАЯ, ХАЙИМ ВЭСАВА, ВИШУА ВЭНЭХАМА, ВЭШЭЗАВА, УРФУА УГЪУЛА, УСЛИХА ВЭХАПАРА \nВЭРЭВАХ ВЭАЦАЛА, ЛАНУ УЛЬХОЛЬ-АМО ЙИСРАЭЛЬ, ВЭИМРУ АМЭН. (Амэн!) \n\nОСЭ ШАЛОМ БИМРОМАВ, У БЭРАХАМАВ ЯААСЭ ШАЛОМ АЛЕНУ, ВЭАЛЬ-КОЛЬ-АМО ЙИСРАЭЛЬ, ВЭИМРУ АМЭН. (Амэн!)";

var adoynoyMelechText =
    "Адой-ной мелех, Адой-ной молох, Адой-ной йимлойх леойлом воэд:Адой-ной мелех, Адой-ной молох, Адой-ной йимлойх леойлом воэд:Веhойо Адой-ной лемелех ал кол hоорец, байойм hаhу йиhйе Адой-ной эход ушмой эход:";
var adonOlamText =
    "Адойн ойлом ашер молах, бэтэрэм кол йецур нивро. Лээйс наасо вэхэфцой койл, азй мэлэх шмой никро. Вэахарэй кихлойс гакойл, лэвадой йимлойх нойро. Вэгу гойо, вэгу гойвэ, вэгу йигье бэсифъоро. Вэгу эход вээйн шейни, лэгамшил лой лэгахбиро. Бэли рэйшис сахлис, вэлой гоойз вэгамисро. Вэгу эйли вэхай гойали, вэцур хэвли бээйс цоро. Вэгу ниси умонойс ли, мэнос койси бэйойм экро. Бэйодой афкид рухи, бээйс ишан вэоиро. Вэим рухи гэвийоси, адойной ли вэлой иро";
var ashreiText =
    "Ашрэй йойшевэй вэйсэхо, ойд йегалэлухо сэло. Ашрэй гоом шекохолой, ашрэй гоом шеадойной элойгов. Тэгило лэдовид, ароймимхо элойгай гамэлэх, вааворэхо шимхо лэойлом воэд. Бэхол йойм аворэхэко, ваагалэло шимхо лэойлом воэд. Годойл адойной умэгулол мэойд, вэлигдулосой эйн хэйкэр. Дойр лэдойр йешабах маасэхо, угвуройсэхо ягиду. Гадар квойд гойдэхо, выдиврэй нифлэойсэхо осихо. Вээзуз нойрэойсэхо йоймэйру, угдулосэхо асапэрэно. Зэхэр рав тувэхо ябиу, выцидкосэхо йеранэйну.";
var borukhSheomarText =
    "Борух шеомар веhойо hоойлом борух hу, борух оймер веойсэ, борух гойзер умекаейм, борух ойсэ берейшис, борух мерахейм ал hоорец, борух мерахейм ал hабриойс, борух мешалэйм сохор тойв лирэйов, борух хай лоад векайом лонецах, борух пойдэ умацил, борух шмой. Борух ато Адой-ной Элой-hейну Мелех hоойлом, hоЭй-л ов hорахамон, hамеhулол бефе амой, мешубох умефойор билшойн хасидов вааводов, увеширэй Довид авдэхо. Неhалэлхо Адой-ной Элой-hейну бишвохойс увизмиройс, негаделхо уншабэйхахо унфоэрхо венамлихехо веназкир шимхо малкейну Элой-hейну йохид хей hо-ойломим мелэх мешубох умфойор адэй ад шмой hагодойл.Борух ато Адой-ной мелэх меhулол батишбохойс.(община – омейн)";
var yistabyText =
    "Йиштабах шимхо лоад малкейну, hоЭ-йл hамелэх hагодойл веhакодойш, башомайим увоорэц, ки лэхо ноэ Адой-ной Элой-hейну вЭй-лой-hей авосейну, лэойлом воэд. Шир ушвохо, hалэйл везимро, ойз умэмшоло, нэцах, гдуло угвуро, тэhило вэсифъэрес, кдушо умалхус. Брохойс веhойдоойс лэшимхо hагодойл вэhакодойш, умэйойлом ад ойлом ато Э-йл. Борух ато Адой-ной Э-йл мелэх годойл умеhулол батишбохойс, Э-йл hаhойдоойс, адойн hанифлоойс, бойрэй кол hанэшомойс, рибойн кол hамаасим, hабойхер бэширэй зимро, мэлэх йохид, хэй hоойломим.(община отвечает – омейн)";
var kadishDeranananText = "";
var kedushaText = "???????";
var summarDeolananText =
    "Благодарим мы Тебя за то, что Ты-Господь, Бог наш и Бог отцов наших, Бог всякой плоти, Создатель наш и Творец мироздания. Надлежит и прославлять благословлять великое и святое Имя Твое за то, что Ты дал нам жизнь и поддер живаешь ее в нас. Так дари и поддерживай ее и впредь! Собери изгнанников ШИХ на во дворах Святыни Твоей, мы же, вернувшись к Тебе, станем соблюдать законы ТВОИ, исполнять волю Твою, служить Тебе всем сердцем. И за эту [возможность благодарить Тебя] мы благодарны Тебе. Благословен Бог, которому возносятся благодарности.";
var amidsprayerText = "";
var ovinText =
    "Овину ов орахамон амэрахэм рахэм но олэйну вэ сэйн бэлибэйну бино лэовин у лэаскиль. Лишмойа лильмойд у ламэйд лишмоир вэ лаасэйс у лэкаем эс кол диврей сальмуд тойросэхо бэагаво. Вэ оэйр энэйну бэсойросэхо вэ дабэйк либэйну бэ мицвойсэхо.";
var sheyiboneText =
    "Шейибонэ бейс hамикдош бимhейро бэйомейну вэсейн хелкейну бэсойросэхо.";
var shmaYisroeilText =
    "Шма Йисроэйл Адой-ной Элой-hэйну Адой-ной эходпроизносят шепотом:   Борух шейм квойд малхусой лэойлом воэдВэоhавто эйс Адой-ной Э-лой-hэхо, бэхол лэвовхо увэхол нафшехо увэхол мэойдэхо:Вэhойу hадворим hоэйлэ, ашер онойхи мэцавхо hайойм ал лэвовэхо:Вэшинантом лэвонэхо вэдибарто бом, бэшивтэхо бэвэйсэхо увэлэхтэхо вадэрэх, увэшохбэхо увэкумэхо:Укшартом лэойс ал йодэхо, вэhойу лэтойтофойс бэйнэйнэхо: Ухсавтом ал мэзузойс бэйсэхо, увишъорэхо.";

var alTiroText =
    "Ал тиро мипахад письойм, умишойас рэшойм ки совой,Уцу эйцо вэсуфор, дабэру довор вэлой йокум,ки имону эйл,Вэад зикно ани hу вэад сэйво ани эсбойл,Ани осиси вааниэсо ваани эсбойл ваамалэйт,Ах цадиким йойду лишмэхо, йейшеву йешорим эс понэхо.";
var additionalprayersonMondayandquarterText = "Он, милостивый,";
var ourdebtText = "Наш долг-восхвалять";
var therepentantprayerofTahanunText = "Бог наш и Бог отцов наших,";
var psalmsforeverydayoftheweekText = "Сегодня, в ... день после субботы,";
var readingtheTorahText =
    "Вайеhи бинсойа hооройн вайоймер Мойшэ.Кумо Адой-ной вейофуцу ойвэхо вейонусу месанъэхо мипонэхо.Ки мицийонйн тэйцей Сойро удвар Адой-ной мирушолоим.Борух шеносан Тойро лэамой Йисроэйл бикдушосой.";
var einKloloineText =
    "Эйн кэйлойгэйну, эйн кадойнэйну, эйн кэмалкэйну, эйн кэмойшиэйну. Ми хэйлойгэйну, ми хадойнэйну, ми хэмалкэйну, ми хэмойшиэйну. Нойдэ лэйлойгэйну, нойдэ ладойнэйну, нойдэ лэмалкэйну, нойдэ лэмойшиэйну. Борух элойгэйну, борух адойнэйну, борух малкэйну, борух мойшиэйну. Ато гу элойгэйну, ато гу адойнэйну, ато гу малкэйну, ато гу мойшиэйну, ато сойшиэйну. Ато сокум тэрахэйм цийойн, ки эйс лэхэнэхо, ки во мойэйд. Ато гу адойной элойгэйну вэйлойгэй авосэйну, шегиктиру авойсэйну лэфонэхо эс ктойрэс гасамим. ";
